// Check for Entra Legacy TLS Login
SigninLogs
| where TimeGenerated > ago(90d)
| where ResultType == "0"
| mv-expand todynamic(AuthenticationProcessingDetails)
| where tostring(AuthenticationProcessingDetails.key) has "Legacy TLS (TLS 1.0, 1.1, 3DES)"
| where tostring(AuthenticationProcessingDetails.value) has "True"
| summarize LegacyLogin=count() by UserPrincipalName
| sort by LegacyLogin desc
